#include<stdio.h>
#include<cs50.h>
#include <math.h>
int main(void)

{ // отримуємо значення більше 0 від користувача.
 float f;
 int c;
 
  do
  {
     f = get_float("change: ");
  }
  while ( f <= 0);
  // прирівнюємо до монет
   c = f * 100;
   if ( c == 419)
   {
 c = round(419.999999);
   } 
  //змінна для рахування кількості монет
  int i= 0;
  // лічимо кількість 25-ток.
   while ( c >= 25)
  { 
      c -= 25;
      i ++;
  }
//рахуємо кількість 10-ток.
 while (c >=10)
  {
      c-=10;
      i++;
  }
  // рахуємо кількість 5-ток.
   while ( c >= 5)
   {
       c-=5;
       i++;
   }
   // рахуємо кількість 1-чок.
   while (c>=1)
   {
       c-=1;
       i++;
   }
  printf("%i\n", i);

}
 