#include <cs50.h>
#include <stdio.h>

int main(void)
{ //start
int i, m, z, k, n, j;
     do
     // присвоєння значення для n і її межі
     {   n = get_int("Height: "); }
     while (n < 1 || n > 8);
          // кількість рядків
   for ( i = 0; i < n; i++)            
  { //змінна для пропусків на початку
     for ( m = (n-1)-i; m !=0; m --)
     {
         printf(" ");
         }
         for ( z = 0; z < i + 1; z ++)
         { printf("#");}
    // змінна для двох пропусків між ришітками
    for (k = 0; k < 2; k++)
      { 
          printf (" ");
          }  
          //змінна для ришіток після крапок
          for (j = 0; j < i + 1; j++)
      {
         printf("#");
      }
      // зміна рядка. в кінці щоб змінювався рядок після завершення всіх дій
       printf("\n");
  }
    //обривання функції while.  
 }


 
