#include<cs50.h>
#include<stdio.h>

int main(void)
{
// с - кредитка.
// r - змінна, з якою будемо проводити моніпуляції.
// t - подібна до r, для множення.
// sk - для підрахунку з чисел додавання
// х2 - для множення на 2
// s - загальна сума чисел.
    long c,r,t ;
    int sk, x2, s;
    // приймаємо номер карти від користувача, який буде більше нуля.
    do
    {
        c = get_long("Number: ");
    }
    while (c <= 0);
     // додаємо кожне наступне число, починаючи з останнього
     for (r = c, sk = 0; r > 0; r/=100 )
     sk += r%10;
     // множимо кожне друге число, починаючи з передостаннього на 2 й додаємо всі числа.
     for (t = c/10, x2 = 0; t > 0; t/=100)
     if (2*(t%10)>9)
     {
         // двозначні розділяємо по одному числу. наприклад 14 на 1 і 4.
         x2 += (2*(t%10))/10;
         x2 += (2*(t%10))%10;
     }
     else
     {
         x2 += (2*(t%10));
     }
// додаємо все що у нас вийшло.
     s = sk+x2;
    //вводимо умову яка вирішує чи картка дійсна чи ні .
    if ( s%10 == 0)
    {
        //стврюємо значення для різних карт.
        if ( c/10000000000000 ==34 || c/10000000000000 == 37)
        {
            printf("American Express\n");
        }

        else if (c/100000000000000 == 51 || c/100000000000000 == 52 || c/100000000000000 == 53|| c/100000000000000 == 54 || c/100000000000000 == 55)
        {
            printf("MasterCard\n");
        }

       else if (c/1000000000000 == 4 || c/1000000000000000 == 4)
        {
            printf("Visa\n");
        }

        else
        {
            printf("1INVALID\n");
        }
    }
        else
        {
            printf("INVALID\n");
        }

}
